FV2304/E_0474.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.37.1: AD: Bestellung Änderung Bilanzierungsverfahren vom NB



end title
:<b>E_0474</b>;
note right
<b><i>Prüfende Rolle: MSB der Marktlokation
end note

if (<b>1: </b> Wurde eine Zählzeit zum Anwendungszeitpunkt bestellt?) then (ja)
    if (<b>2: </b> Ist die gewünschte Zählzeit zum Anwendungszeitpunkt Bestandteil der Übersicht der Zählzeitdefinition, welche zuvor vom NB übermittelt wurde?) then (ja)
    else (nein)
        :A01;
        note left
            Zählzeitdefinition zum Anwendungszeitpunkt nicht bekannt
        endnote
        kill;
    endif
    if (<b>3: </b> Liegt zum Anwendungszeitpunkt die ausgerollte Zählzeit zur Zählzeitdefinition vor?) then (ja)
    else (nein)
        :A02;
        note left
            Ausgerollte Zählzeit zur Zählzeitdefinition liegt zum Anwendungszeitpunkt nicht vor
        endnote
        kill;
    endif
    if (<b>4: </b> Ist die gewünschte Konfiguration zum gewünschten Termin bereits umgesetzt?) then (ja)
        :A03;
        note left
            Gewünschte Konfiguration liegt zum Termin bereits vor.
        endnote
        kill;
    else (nein)
    endif
    if (<b>5: </b> Entspricht der geplante Termin zur Änderung der Konfiguration den Prozessfristvorgaben?) then (ja)
    else (nein)
        :A04;
        note left
            Fristüberschreitung
        endnote
        kill;
    endif
    if (<b>6: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Ablehnung Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
        endnote
        kill;
    else (nein)
        :A05;
        note left
            Bestellung wird an den MSB der Messlokation weitergeleitet
        endnote
        kill;
    endif
else (nein)
endif
if (<b>4: </b> Ist die gewünschte Konfiguration zum gewünschten Termin bereits umgesetzt?) then (ja)
    :A03;
    note left
        Gewünschte Konfiguration liegt zum Termin bereits vor.
    endnote
    kill;
else (nein)
endif
if (<b>5: </b> Entspricht der geplante Termin zur Änderung der Konfiguration den Prozessfristvorgaben?) then (ja)
else (nein)
    :A04;
    note left
        Fristüberschreitung
    endnote
    kill;
endif
if (<b>6: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Ablehnung Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
    endnote
    kill;
else (nein)
    :A05;
    note left
        Bestellung wird an den MSB der Messlokation weitergeleitet
    endnote
    kill;
endif

@enduml
